# FIT5196 Assessment 2 Task2
#### Student Name: William Clark
#### Student ID: 31993303

Date: 23/11/2020

Version: 1.0

Environment: Python 3 and Jupyter notebook

Libraries used: please include the main libraries you used in your assignment here, e.g.,:
* pandas 
* re 
* numpy
* random


<span style="color: red"> Note that this is a sample notebook only. You will need to fill in the proper markdown and code blocks. You might also want to make necessary changes to the structure to meet your own needs. It is important to make sure the logic of how you finish the assessment is clearly shown in this notebook! </span>

## Import libraries

In [1]:
# Code to import libraries as you need in this assessment, e.g.,
import pandas as pd
import numpy as np
import re
import random

## Task 2. Integration

In this task, you are given a 2nd job advertisement dataset dataset2.csv. You will then integrate this dataset with the output from Task 1 (dataset1_solution.csv) and resolve any schema level and data level conflicts. 

<span style="color: red"> You might have complex notebook structure in this section, please feel free to create your own notebook structure. </span>

In [2]:
# Code to audit data
csvdf_1 = pd.read_table("dataset2.csv", sep=",")
type(csvdf_1)

pandas.core.frame.DataFrame

In [3]:
jobs2 = csvdf_1
jobs2.head(5)

,Opening,Closing,Job Title,Organisation,Location,Category,Salary per month,Fraction,Contract Type
0,2013-10-06 00:00:00,2013-12-05 00:00:00,Aviation loans administration,cer Financial,London,Finance and Accounting,2800,NaN,Contract
1,2012-10-03 12:00:00,2012-11-02 12:00:00,"Payroll Analyst City upto **** , ****",LMA Recruitment Ltd,London,Finance and Accounting,2917,NaN,Permanent
2,2012-01-01 00:00:00,2012-01-31 00:00:00,Investment Team Assistant for leading Private ...,Austin Andrew Ltd,London,Finance and Accounting,3750,NaN,Permanent
3,2012-10-14 00:00:00,2012-11-13 00:00:00,SWAPS COLLATERAL CONTROL OFFICER,Brian Durham Recruitment Services Limited,City,Finance and Accounting,3333,NaN,Permanent
4,2012-11-17 12:00:00,2013-01-16 12:00:00,Loans Administration Temp,cer Financial,London,Finance and Accounting,3280,NaN,Contract

In [4]:
jobs2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 334 entries, 0 to 333
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Opening           334 non-null    object
 1   Closing           334 non-null    object
 2   Job Title         334 non-null    object
 3   Organisation      334 non-null    object
 4   Location          334 non-null    object
 5   Category          334 non-null    object
 6   Salary per month  334 non-null    int64
 7   Fraction          3 non-null      object
 8   Contract Type     327 non-null    object
dtypes: int64(1), object(8)
memory usage: 23.6+ KB

In [5]:
ID = random.sample(range(72705245, 72705900), 334)
#generate ID column with random values starting at maximum value from jobs df, imported below

In [6]:
jobsID = pd.DataFrame(ID)
jobs2 = pd.concat([jobsID, jobs2], axis = 1)

In [7]:
jobs2.rename(columns = {0:'Id'}, inplace = True)
jobs2.head(5)
#rename ID column to match jobs df

,Id,Opening,Closing,Job Title,Organisation,Location,Category,Salary per month,Fraction,Contract Type
0,72705821,2013-10-06 00:00:00,2013-12-05 00:00:00,Aviation loans administration,cer Financial,London,Finance and Accounting,2800,NaN,Contract
1,72705610,2012-10-03 12:00:00,2012-11-02 12:00:00,"Payroll Analyst City upto **** , ****",LMA Recruitment Ltd,London,Finance and Accounting,2917,NaN,Permanent
2,72705845,2012-01-01 00:00:00,2012-01-31 00:00:00,Investment Team Assistant for leading Private ...,Austin Andrew Ltd,London,Finance and Accounting,3750,NaN,Permanent
3,72705835,2012-10-14 00:00:00,2012-11-13 00:00:00,SWAPS COLLATERAL CONTROL OFFICER,Brian Durham Recruitment Services Limited,City,Finance and Accounting,3333,NaN,Permanent
4,72705535,2012-11-17 12:00:00,2013-01-16 12:00:00,Loans Administration Temp,cer Financial,London,Finance and Accounting,3280,NaN,Contract

In [8]:
jobs2["Source"] = np.nan
#source column added to match jobs df

In [9]:
jobs2 = jobs2[['Id','Job Title', 'Location', 'Organisation', 'Fraction', 'Contract Type', 'Category', 'Salary per month', 'Opening', 'Closing', 'Source']]
jobs2.head(5)
#jobs2 df columns ordered to match jobs df

,Id,Job Title,Location,Organisation,Fraction,Contract Type,Category,Salary per month,Opening,Closing,Source
0,72705821,Aviation loans administration,London,cer Financial,NaN,Contract,Finance and Accounting,2800,2013-10-06 00:00:00,2013-12-05 00:00:00,NaN
1,72705610,"Payroll Analyst City upto **** , ****",London,LMA Recruitment Ltd,NaN,Permanent,Finance and Accounting,2917,2012-10-03 12:00:00,2012-11-02 12:00:00,NaN
2,72705845,Investment Team Assistant for leading Private ...,London,Austin Andrew Ltd,NaN,Permanent,Finance and Accounting,3750,2012-01-01 00:00:00,2012-01-31 00:00:00,NaN
3,72705835,SWAPS COLLATERAL CONTROL OFFICER,City,Brian Durham Recruitment Services Limited,NaN,Permanent,Finance and Accounting,3333,2012-10-14 00:00:00,2012-11-13 00:00:00,NaN
4,72705535,Loans Administration Temp,London,cer Financial,NaN,Contract,Finance and Accounting,3280,2012-11-17 12:00:00,2013-01-16 12:00:00,NaN

In [10]:
jobs2['Salary per month'] = jobs2['Salary per month'] * 12
#recalculate monthly salary to match yearly salary in jobs df

In [11]:
jobs2['Fraction'].fillna('full_time', inplace=True)
#NaN values to be filled as full_time to match jobs df

In [12]:
#column names changed to match jobs df
jobs2.rename(columns={"Job Title": "Title", "Organisation": "Company", 'Fraction':'ContractType', 'Contract Type':'ContractTime', 'Salary per month':'Salary', 'Opening':'OpenDate', 'Closing':'CloseDate'}, inplace = True)

In [13]:
jobs = pd.read_table("dataset1_solution.csv", sep=",")
jobs.head(4)
#introduce jobs df

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,Source
0,12612628,Engineering Systems Analyst,Dorking,Gregory Martin International,full_time,permanent,Engineering Jobs,25000.0,20130708T120000,20130906T120000,cv-library.co.uk
1,12612830,Stress Engineer Glasgow,Glasgow,Gregory Martin International,full_time,permanent,Engineering Jobs,30000.0,20120130T000000,20120330T000000,cv-library.co.uk
2,12612844,Modelling and simulation analyst,Hampshire,Gregory Martin International,full_time,permanent,Engineering Jobs,30000.0,20121221T150000,20130120T150000,cv-library.co.uk
3,12613049,Engineering Systems Analyst / Mathematical Mod...,Surrey,Gregory Martin International,full_time,permanent,Engineering Jobs,27500.0,20131208T150000,20140206T150000,cv-library.co.uk

In [14]:
jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55169 entries, 0 to 55168
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            55169 non-null  int64
 1   Title         55168 non-null  object
 2   Location      55169 non-null  object
 3   Company       55169 non-null  object
 4   ContractType  55169 non-null  object
 5   ContractTime  55169 non-null  object
 6   Category      55169 non-null  object
 7   Salary        55169 non-null  float64
 8   OpenDate      55169 non-null  object
 9   CloseDate     55169 non-null  object
 10  Source        55169 non-null  object
dtypes: float64(1), int64(1), object(9)
memory usage: 4.6+ MB

In [15]:
#we need to make category values in jobs df match jobs2 df
jobs['Category'] = jobs['Category'].replace({'\sJobs':'', 'Accounting & Finance':'Finance and Accounting', 'IT':'Information Technology'}, regex=True)

In [16]:
jobs['Category'].value_counts()

Information Technology         14344
Healthcare & Nursing            8809
Engineering                     8210
Finance and Accounting          7138
Sales                           5349
Hospitality & Catering          4788
Teaching                        3779
PR, Advertising & Marketing     2752
Name: Category, dtype: int64

In [17]:
jobs2['Category'].value_counts()
#check category values in jobs2 to see if they now match jobs df

Finance and Accounting           319
Information Technology            12
PR, Advertising and Marketing      3
Name: Category, dtype: int64

In [18]:
jobs2['Salary'] = jobs2['Salary'].astype(np.float)
jobs2['OpenDate'] = pd.to_datetime(jobs2['OpenDate'])
jobs2['CloseDate'] = pd.to_datetime(jobs2['CloseDate'])
jobs2['OpenDate'] = jobs2['OpenDate'].dt.strftime("%Y%m%dT%H%M%S")
jobs2['CloseDate'] = jobs2['CloseDate'].dt.strftime("%Y%m%dT%H%M%S")
#convert jobs2 strings to datetime, and then reformat into correct YYYYMMDDTHHMMSS string format

In [19]:
jobs.sort_values(by=['Id'], inplace = True, ascending = False)
jobs.head(5)
#this helped inform what value range the randomly generated 'ID' value for jobs2 would be

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,Source
55158,72705244,Quality Assurance Environmental Manager Nottin...,Nottingham,Stephen James Consulting,full_time,permanent,Healthcare & Nursing,35000.0,20120110T150000,20120409T150000,tntjobs.co.uk
55157,72705240,Barclays Future Leaders Development Programmes,Hackney,Barclays,full_time,permanent,Information Technology,36000.0,20121223T150000,20130221T150000,grb.uk.com
55156,72705221,Senior Financial Advisor,London,Fram Executive Search.,full_time,permanent,Finance and Accounting,40000.0,20130126T000000,20130225T000000,ifaonlinejobs.co.uk
55155,72705205,Pensions Administrators (Temporary/Contract),UK,Abenefit2u,full_time,contract,Finance and Accounting,24000.0,20130801T150000,20130831T150000,cv-library.co.uk
55154,72705203,TEACHER OF BUSINESS STUDIES AND LAW,Salisbury,,full_time,contract,Teaching,22800.0,20120123T120000,20120206T120000,hays.co.uk

In [21]:
jobs = pd.concat([jobs, jobs2])
#bring two formatted tables together

In [22]:
jobs['Title'] = jobs['Title'].astype(str)
jobs['Location'] = jobs['Location'].astype(str)
jobs['Company'] = jobs['Company'].astype(str)
jobs['ContractType'] = jobs['ContractType'].astype(str)
jobs['ContractTime'] = jobs['ContractTime'].astype(str)
jobs['Category'] = jobs['Category'].astype(str)
jobs['Source'] = jobs['Source'].astype(str)

#double check all necessary attributes are string

In [23]:
jobs.info()
#A final check to make sure data is in correct format

<class 'pandas.core.frame.DataFrame'>
Int64Index: 55503 entries, 55158 to 333
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            55503 non-null  int64
 1   Title         55503 non-null  object
 2   Location      55503 non-null  object
 3   Company       55503 non-null  object
 4   ContractType  55503 non-null  object
 5   ContractTime  55503 non-null  object
 6   Category      55503 non-null  object
 7   Salary        55503 non-null  float64
 8   OpenDate      55503 non-null  object
 9   CloseDate     55503 non-null  object
 10  Source        55503 non-null  object
dtypes: float64(1), int64(1), object(9)
memory usage: 5.1+ MB

......

## The Global Key
Write down the identified global key:

**| Title  | Company  | Location  | Category  |**

In [25]:
#finally remove duplicates based on the global key
jobs.drop_duplicates(subset=['Title', 'Company', 'Location', 'Category'], keep=False)
jobs.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 55503 entries, 55158 to 333
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            55503 non-null  int64
 1   Title         55503 non-null  object
 2   Location      55503 non-null  object
 3   Company       55503 non-null  object
 4   ContractType  55503 non-null  object
 5   ContractTime  55503 non-null  object
 6   Category      55503 non-null  object
 7   Salary        55503 non-null  float64
 8   OpenDate      55503 non-null  object
 9   CloseDate     55503 non-null  object
 10  Source        55503 non-null  object
dtypes: float64(1), int64(1), object(9)
memory usage: 5.1+ MB

## Saving data
Save the integrated data

In [24]:
# code to save output data
jobs.to_csv('dataset_integrated.csv',index=False)

## Summary
Give a short summary and anything you would like to talk about assessment 2 part 2 here.

In [ ]:
#Report to follow